// コマンドキュー制御クラス

#pragma once

#include "device.h"

//---------------------------------------------------------------------------------
/**
 * @brief	コマンドキュー制御クラス
 */
class CommandQueue final {
public:
    //---------------------------------------------------------------------------------
    /**
     * @brief    コンストラクタ
     */
    CommandQueue() = default;

    //---------------------------------------------------------------------------------
    /**
     * @brief    デストラクタ
     */
    ~CommandQueue() = default;

    //---------------------------------------------------------------------------------
    /**
     * @brief	コマンドキューの生成
     * @return	生成の成否
     */
    [[nodiscard]] bool create() noexcept;

    //---------------------------------------------------------------------------------
    /**
     * @brief	コマンドキューを取得する
     * @return	コマンドキューのポインタ
     */
    [[nodiscard]] ID3D12CommandQueue* get() const noexcept;

private:
    Microsoft::WRL::ComPtr<ID3D12CommandQueue> commandQueue_{};  /// コマンドキュー
};