// 敵制御クラス

#pragma once

#include "game_object.h"

namespace game {

    //---------------------------------------------------------------------------------
    /**
     * @brief	敵制御
     */
    class Enemy : public GameObject {
    public:
        //---------------------------------------------------------------------------------
        /**
         * @brief    コンストラクタ
         */
        Enemy() = default;

        //---------------------------------------------------------------------------------
        /**
         * @brief    デストラクタ
         */
        virtual ~Enemy() = default;

    public:
        //---------------------------------------------------------------------------------
        /**
         * @brief	オブジェクトの初期化
         */
        virtual void initialize() noexcept override;

        //---------------------------------------------------------------------------------
        /**
         * @brief	オブジェクトの更新
         */
        virtual void update() noexcept override;

    public:
        //---------------------------------------------------------------------------------
        /**
         * @brief	ヒットした時の処理
         */
        virtual void onHit() noexcept override;
    };
}  // namespace game