// フェンス（CPUとGPUの動機）制御クラス

#pragma once

#include "device.h"

//---------------------------------------------------------------------------------
/**
 * @brief	フェンス（CPUとGPUの動機）制御クラス
 */
class Fence final {
public:
    //---------------------------------------------------------------------------------
    /**
     * @brief    コンストラクタ
     */
    Fence() = default;

    //---------------------------------------------------------------------------------
    /**
     * @brief    デストラクタ
     */
    ~Fence() = default;

    //---------------------------------------------------------------------------------
    /**
     * @brief	フェンスを作成する
     * @return	作成出来た場合は true
     */
    [[nodiscard]] bool create() noexcept;

    //---------------------------------------------------------------------------------
    /**
     * @brief	同期待ちを行う
     * @param fenceValue	フェンス値
     */
    void wait(UINT64 fenceValue) const noexcept;

    //---------------------------------------------------------------------------------
    /**
     * @brief	フェンスを取得する
     */
    [[nodiscard]] ID3D12Fence* get() const noexcept;

private:
    Microsoft::WRL::ComPtr<ID3D12Fence> fence_{};         /// フェンス
    HANDLE                              waitGpuEvent_{};  /// GPU と CPU 同期用のイベントハンドル
};
