// ゲームクラス

#pragma once

#include "game_object.h"

namespace game {

    //---------------------------------------------------------------------------------
    /**
     * @brief	プレイヤー
     */
    class Player : public GameObject {
    public:
        //---------------------------------------------------------------------------------
        /**
         * @brief    コンストラクタ
         */
        Player() = default;

        //---------------------------------------------------------------------------------
        /**
         * @brief    デストラクタ
         */
        virtual ~Player() = default;

    public:
        //---------------------------------------------------------------------------------
        /**
         * @brief	オブジェクトの初期化
         */
        virtual void initialize() noexcept override;

        //---------------------------------------------------------------------------------
        /**
         * @brief	オブジェクトの更新
         */
        virtual void update() noexcept override;
    };
}  // namespace game
